export const profile = [
    ["名前", "丼猫"],
    ["誕生日", "2008年08月06日"],
    ["性別", "男"],
    ["資格とか", "◎基本情報技術者　◎ITパスポート　◎Illustratorクリエーター試験スタンダード"],
    ["所属", "学生"],
];

export const languages = [
    [
        "HTML",
        "学校で必ずやらないといけない課題があったんで、やってみたらできるようになったやつ。サイトとかを作れるようになった",
    ],
    [
        "CSS",
        "HTMLのサイトに色とかつけるやつ。これが意外とめんどくさい。CSS学ぶ前にデザイン学ばないとだった…",
    ],
    [
        "JavaScript",
        "CSSでアニメーションとかしてたけど、だんだん不可能になってきたから始めてみた。とても面白く楽しい。めんどくさい作業の自動化に使ってる",
    ],
    [
        "TypeScript",
        "JavaScriptをやっていると、だんだん昔作ってた関数の引数がわからなくなってくる。そんなときに出会ったやつ。",
    ],
    ["Lua", "Stormworksでマイコン作るときに使ったやつ。閉じるのがendなのが面白かった。"],
    ["C言語", "C#とOS自作をしたいと考えて、ならC言語始めるか？で始めたやつ。全然できない（泣）"],
];

export const history = [
    ["2024年8月", "ホームセンター", "不採用"],
    ["2024年8月", "リサイクルショップ", "不採用"],
    ["2024年9月", "牛丼屋", "不採用"],
    ["2024年9月", "お肉屋", "不採用"],
    ["2024年10月", "コンビニ", "採用"],
    ["2025年3月", "コンテスト - 3D動画", "四位"],
    ["2025年9月", "コンテスト - WEBサイト", "参加賞"],
    ["2026年3月", "コンテスト - 動画", "一位"],
];
